measurements/wsgi_benchmark_1_ms/threaded_results.txt

1 threads
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   146.98ms    1.47ms 172.66ms   98.10%
    Req/Sec     7.61      2.54    20.00     53.30%
  261262 requests in 10.00m, 86.71MB read
Requests/sec:    435.36
Transfer/sec:    147.96KB
latency_values:
{"Min": 6.707, "Max": 172.657, "Avg": 146.977, "Stdev": 1.472}
request_values:
{"Min": 4, "Max": 20, "Avg": 7, "Stdev": 2}
latency_distribution:
{"1%": 146.015, "25%": 146.594, "50%": 146.943, "75%": 147.314, "90%": 147.698, "99%": 148.931, "99.9%": 150.664, "99.99%": 155.450 }
percentiles:
{"percentiles": [ 146.015, 146.082, 146.129, 146.164, 146.195, 146.223, 146.248, 146.271, 146.293, 146.314, 146.335, 146.355, 146.375, 146.395, 146.416, 146.436, 146.455, 146.474, 146.493, 146.511, 146.529, 146.546, 146.562, 146.579, 146.594, 146.609, 146.623, 146.638, 146.651, 146.665, 146.679, 146.692, 146.705, 146.719, 146.733, 146.746, 146.760, 146.774, 146.788, 146.802, 146.816, 146.830, 146.844, 146.858, 146.873, 146.886, 146.900, 146.915, 146.928, 146.943, 146.956, 146.970, 146.983, 146.997, 147.011, 147.024, 147.037, 147.050, 147.062, 147.076, 147.090, 147.104, 147.118, 147.133, 147.149, 147.164, 147.180, 147.195, 147.211, 147.228, 147.244, 147.261, 147.278, 147.296, 147.314, 147.333, 147.353, 147.373, 147.393, 147.415, 147.437, 147.461, 147.486, 147.512, 147.538, 147.565, 147.596, 147.627, 147.660, 147.698, 147.740, 147.787, 147.838, 147.903, 147.975, 148.062, 148.190, 148.393, 148.931, 172.657]}

2 threads
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   109.77ms    2.11ms 154.02ms   72.58%
    Req/Sec     9.49      1.51    30.00     90.42%
  349804 requests in 10.00m, 116.09MB read
Requests/sec:    582.91
Transfer/sec:    198.10KB
latency_values:
{"Min": 5.423, "Max": 154.025, "Avg": 109.775, "Stdev": 2.109}
request_values:
{"Min": 4, "Max": 30, "Avg": 9, "Stdev": 1}
latency_distribution:
{"1%": 105.630, "25%": 108.428, "50%": 109.680, "75%": 111.034, "90%": 112.324, "99%": 114.783, "99.9%": 116.820, "99.99%": 119.129 }
percentiles:
{"percentiles": [ 105.630, 106.075, 106.367, 106.578, 106.758, 106.908, 107.043, 107.164, 107.272, 107.371, 107.468, 107.556, 107.641, 107.721, 107.796, 107.869, 107.940, 108.006, 108.072, 108.133, 108.194, 108.254, 108.313, 108.371, 108.428, 108.483, 108.537, 108.592, 108.646, 108.698, 108.750, 108.802, 108.853, 108.903, 108.954, 109.005, 109.055, 109.103, 109.153, 109.200, 109.249, 109.295, 109.343, 109.393, 109.440, 109.489, 109.536, 109.584, 109.632, 109.680, 109.730, 109.777, 109.826, 109.874, 109.923, 109.973, 110.023, 110.074, 110.126, 110.177, 110.228, 110.280, 110.333, 110.387, 110.442, 110.497, 110.550, 110.607, 110.664, 110.725, 110.784, 110.846, 110.908, 110.969, 111.034, 111.099, 111.166, 111.236, 111.308, 111.384, 111.459, 111.540, 111.624, 111.712, 111.803, 111.896, 111.993, 112.091, 112.204, 112.324, 112.457, 112.600, 112.759, 112.938, 113.136, 113.385, 113.691, 114.101, 114.783, 154.025]}

4 threads
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   123.78ms    4.45ms 238.20ms   71.34%
    Req/Sec     8.79      2.16    30.00     76.46%
  310244 requests in 10.00m, 102.96MB read
Requests/sec:    516.99
Transfer/sec:    175.69KB
latency_values:
{"Min": 5.813, "Max": 238.199, "Avg": 123.776, "Stdev": 4.450}
request_values:
{"Min": 3, "Max": 30, "Avg": 8, "Stdev": 2}
latency_distribution:
{"1%": 114.663, "25%": 120.840, "50%": 123.532, "75%": 126.423, "90%": 129.296, "99%": 135.517, "99.9%": 141.721, "99.99%": 149.558 }
percentiles:
{"percentiles": [ 114.663, 115.655, 116.282, 116.765, 117.155, 117.485, 117.777, 118.039, 118.275, 118.498, 118.710, 118.911, 119.095, 119.273, 119.438, 119.598, 119.756, 119.908, 120.056, 120.195, 120.332, 120.465, 120.589, 120.719, 120.840, 120.960, 121.081, 121.198, 121.313, 121.427, 121.541, 121.652, 121.765, 121.875, 121.985, 122.092, 122.198, 122.304, 122.408, 122.513, 122.616, 122.718, 122.821, 122.920, 123.022, 123.125, 123.229, 123.332, 123.430, 123.532, 123.635, 123.740, 123.845, 123.946, 124.049, 124.156, 124.261, 124.370, 124.477, 124.588, 124.700, 124.812, 124.922, 125.039, 125.150, 125.265, 125.383, 125.507, 125.630, 125.758, 125.883, 126.012, 126.142, 126.280, 126.423, 126.567, 126.715, 126.867, 127.016, 127.182, 127.352, 127.527, 127.712, 127.895, 128.092, 128.301, 128.530, 128.768, 129.016, 129.296, 129.600, 129.935, 130.317, 130.747, 131.238, 131.835, 132.605, 133.685, 135.517, 238.199]}

8 threads
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   131.07ms    9.12ms   1.06s    89.68%
    Req/Sec     8.42      2.36    50.00     69.23%
  293102 requests in 10.00m, 97.27MB read
Requests/sec:    488.42
Transfer/sec:    165.99KB
latency_values:
{"Min": 5.645, "Max": 1064.182, "Avg": 131.074, "Stdev": 9.121}
request_values:
{"Min": 0, "Max": 50, "Avg": 8, "Stdev": 2}
latency_distribution:
{"1%": 119.032, "25%": 127.232, "50%": 130.497, "75%": 134.234, "90%": 138.385, "99%": 147.694, "99.9%": 158.389, "99.99%": 485.835 }
percentiles:
{"percentiles": [ 119.032, 120.494, 121.420, 122.063, 122.578, 123.014, 123.410, 123.754, 124.065, 124.347, 124.622, 124.871, 125.100, 125.320, 125.525, 125.727, 125.921, 126.101, 126.278, 126.446, 126.613, 126.772, 126.925, 127.081, 127.232, 127.378, 127.520, 127.659, 127.800, 127.940, 128.067, 128.200, 128.329, 128.460, 128.592, 128.721, 128.855, 128.980, 129.106, 129.228, 129.353, 129.479, 129.605, 129.732, 129.861, 129.989, 130.113, 130.240, 130.369, 130.497, 130.626, 130.758, 130.883, 131.016, 131.151, 131.283, 131.415, 131.550, 131.693, 131.829, 131.971, 132.109, 132.252, 132.401, 132.551, 132.705, 132.858, 133.012, 133.175, 133.338, 133.515, 133.688, 133.861, 134.043, 134.234, 134.429, 134.631, 134.839, 135.065, 135.290, 135.525, 135.773, 136.037, 136.312, 136.606, 136.911, 137.235, 137.577, 137.969, 138.385, 138.847, 139.340, 139.892, 140.526, 141.240, 142.126, 143.292, 144.887, 147.694, 1064.182]}

16 threads
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   134.32ms   27.18ms   2.37s    99.31%
    Req/Sec     8.29      2.43    60.00     66.48%
  286990 requests in 10.00m, 95.25MB read
Requests/sec:    478.24
Transfer/sec:    162.53KB
latency_values:
{"Min": 5.975, "Max": 2367.398, "Avg": 134.316, "Stdev": 27.182}
request_values:
{"Min": 0, "Max": 60, "Avg": 8, "Stdev": 2}
latency_distribution:
{"1%": 119.880, "25%": 129.306, "50%": 132.871, "75%": 136.998, "90%": 142.436, "99%": 157.528, "99.9%": 189.467, "99.99%": 1578.071 }
percentiles:
{"percentiles": [ 119.880, 121.675, 122.748, 123.490, 124.082, 124.593, 125.038, 125.424, 125.787, 126.102, 126.394, 126.674, 126.937, 127.190, 127.420, 127.642, 127.861, 128.058, 128.252, 128.439, 128.623, 128.801, 128.971, 129.143, 129.306, 129.469, 129.630, 129.791, 129.943, 130.094, 130.241, 130.387, 130.527, 130.666, 130.808, 130.950, 131.094, 131.235, 131.376, 131.515, 131.651, 131.789, 131.921, 132.054, 132.188, 132.326, 132.462, 132.594, 132.735, 132.871, 133.007, 133.144, 133.280, 133.420, 133.560, 133.703, 133.848, 133.996, 134.149, 134.297, 134.450, 134.606, 134.758, 134.919, 135.086, 135.253, 135.426, 135.601, 135.788, 135.978, 136.170, 136.363, 136.563, 136.774, 136.998, 137.230, 137.469, 137.718, 137.990, 138.274, 138.568, 138.880, 139.211, 139.570, 139.957, 140.363, 140.801, 141.298, 141.841, 142.436, 143.101, 143.857, 144.700, 145.718, 146.936, 148.486, 150.446, 153.196, 157.528, 2367.398]}

32 threads
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   135.30ms   55.68ms   3.47s    99.64%
    Req/Sec     8.30      2.43    50.00     66.61%
  287241 requests in 10.00m, 95.33MB read
Requests/sec:    478.66
Transfer/sec:    162.67KB
latency_values:
{"Min": 7.783, "Max": 3471.714, "Avg": 135.299, "Stdev": 55.682}
request_values:
{"Min": 0, "Max": 50, "Avg": 8, "Stdev": 2}
latency_distribution:
{"1%": 118.415, "25%": 129.039, "50%": 132.672, "75%": 136.894, "90%": 142.446, "99%": 160.924, "99.9%": 838.988, "99.99%": 2679.098 }
percentiles:
{"percentiles": [ 118.415, 120.891, 122.114, 122.951, 123.615, 124.142, 124.597, 125.015, 125.386, 125.722, 126.035, 126.324, 126.593, 126.850, 127.089, 127.319, 127.542, 127.750, 127.949, 128.140, 128.331, 128.514, 128.696, 128.870, 129.039, 129.197, 129.360, 129.513, 129.676, 129.831, 129.978, 130.133, 130.279, 130.423, 130.566, 130.714, 130.858, 130.999, 131.139, 131.281, 131.425, 131.562, 131.705, 131.840, 131.975, 132.110, 132.248, 132.389, 132.529, 132.672, 132.813, 132.957, 133.102, 133.244, 133.388, 133.532, 133.682, 133.830, 133.984, 134.139, 134.299, 134.462, 134.630, 134.792, 134.960, 135.126, 135.303, 135.486, 135.669, 135.851, 136.036, 136.239, 136.448, 136.668, 136.894, 137.139, 137.387, 137.649, 137.914, 138.196, 138.493, 138.806, 139.148, 139.504, 139.886, 140.318, 140.788, 141.291, 141.840, 142.446, 143.136, 143.917, 144.815, 145.891, 147.197, 148.836, 151.085, 154.441, 160.924, 3471.714]}

64 threads
Running 10m test @ http://127.0.0.1:8000/flask_metric
  64 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   134.84ms   51.47ms   3.32s    99.60%
    Req/Sec     8.31      2.42    50.00     66.88%
  287813 requests in 10.00m, 95.52MB read
Requests/sec:    479.61
Transfer/sec:    162.99KB
latency_values:
{"Min": 7.310, "Max": 3318.421, "Avg": 134.840, "Stdev": 51.470}
request_values:
{"Min": 0, "Max": 50, "Avg": 8, "Stdev": 2}
latency_distribution:
{"1%": 118.184, "25%": 128.698, "50%": 132.385, "75%": 136.692, "90%": 142.261, "99%": 161.552, "99.9%": 736.055, "99.99%": 2547.192 }
percentiles:
{"percentiles": [ 118.184, 120.446, 121.653, 122.497, 123.166, 123.715, 124.188, 124.614, 124.984, 125.321, 125.645, 125.937, 126.217, 126.478, 126.721, 126.948, 127.172, 127.395, 127.600, 127.802, 127.992, 128.175, 128.351, 128.524, 128.698, 128.871, 129.033, 129.195, 129.353, 129.507, 129.659, 129.811, 129.957, 130.101, 130.247, 130.394, 130.537, 130.681, 130.826, 130.971, 131.114, 131.256, 131.396, 131.536, 131.678, 131.820, 131.959, 132.101, 132.244, 132.385, 132.526, 132.672, 132.814, 132.960, 133.110, 133.257, 133.407, 133.558, 133.712, 133.866, 134.032, 134.195, 134.361, 134.530, 134.700, 134.875, 135.056, 135.243, 135.429, 135.625, 135.822, 136.020, 136.232, 136.455, 136.692, 136.928, 137.181, 137.431, 137.712, 137.997, 138.300, 138.630, 138.983, 139.348, 139.732, 140.145, 140.608, 141.089, 141.641, 142.261, 142.934, 143.727, 144.626, 145.715, 147.017, 148.736, 150.989, 154.454, 161.552, 3318.421]}